//给你一个长度为 n 的整数数组 nums，其中 n > 1，返回输出数组 output ，其中 output[i] 等于 nums 中除 nums[i] 之
//外其余各元素的乘积。 
//
// 
//
// 示例: 
//
// 输入: [1,2,3,4]
//输出: [24,12,8,6] 
//
// 
//
// 提示：题目数据保证数组之中任意元素的全部前缀元素和后缀（甚至是整个数组）的乘积都在 32 位整数范围内。 
//
// 说明: 请不要使用除法，且在 O(n) 时间复杂度内完成此题。 
//
// 进阶： 
//你可以在常数空间复杂度内完成这个题目吗？（ 出于对空间复杂度分析的目的，输出数组不被视为额外空间。） 
// Related Topics 数组 前缀和 
// 👍 1037 👎 0


//leetcode submit region begin(Prohibit modification and deletion)
class Solution {
public:
    vector<int> productExceptSelf(vector<int>& nums) {
        // 不能使用除法
        // O(n) 时间内完成
        int n = nums.size();
        if (n == 0) return  vector<int>();

        vector<int> ans(n, 1);
        // 下三角
        for (int i=1; i<n; i++) {
            ans[i] = ans[i-1] * nums[i-1];
        }

        // 上三角
        int tmp = 1;
        for (int i=n-2; i>=0; i--) {
            tmp *= nums[i+1];
            ans[i] = tmp * ans[i]; // 下三角已经求得了
        }

        // 返回答案
        return ans;
    }
};
//leetcode submit region end(Prohibit modification and deletion)
